In [37]:
import pandas as pd

1. desrciption
2. diagnosis
3. prediction
4. action/prescription

In [38]:
df=pd.read_csv('u.data')

In [39]:
df.head()

      0\t50\t5\t881250949
0    0\t172\t5\t881250949
1    0\t133\t1\t881250949
2  196\t242\t3\t881250949
3  186\t302\t3\t891717742
4   22\t377\t1\t878887116

In [40]:
# the column names 
cols = ['user_id','movie_id','rating','ts']

In [73]:
# read the file
df=pd.read_csv('u.data',sep='\t',names=cols)

In [42]:
a = [1,2,3,4,5]

In [43]:
b=[]
for i in a:
    b.append(i*2)
b

[2, 4, 6, 8, 10]

In [44]:
b=[i*2 for i in a]

In [45]:
b

[2, 4, 6, 8, 10]

In [85]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [71]:
item_cols=['movie_id'+'title'] + list(range(22))

In [74]:
df1.head()

       movie_idtitle
1   Toy Story (1995)
2   GoldenEye (1995)
3  Four Rooms (1995)
4  Get Shorty (1995)
5     Copycat (1995)

In [78]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [90]:
# read the other file
df1 = pd.read_csv('u.item',sep='|',encoding = "ISO-8859-1",names=item_cols)[['movie_id','title']]

In [87]:
df1.shape

(1682, 23)

In [91]:
df1.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

# Exploratory data analysis(EDA)

In [52]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [53]:
df.sample(5)

       user_id  movie_id  rating         ts
86200      823       202       4  878438672
77177      836       318       5  885754172
57122      327       367       4  887819355
81438      721       321       3  877137447
27084       18        94       3  880131676

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [79]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

Try to find the different data

1. string with categorical info 
2. string with random stuff
3. numbers with quantified info
4. number with categotical info
5. random number or id sort of data

In [56]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [57]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [58]:
df['rating'].nunique()

5

In [59]:
df['user_id'].nunique()

944

In [60]:
df['movie_id'].nunique()

1682

In [61]:
df1.head()

       movie_idtitle
1   Toy Story (1995)
2   GoldenEye (1995)
3  Four Rooms (1995)
4  Get Shorty (1995)
5     Copycat (1995)

In [62]:
# Merging dataframe

In [92]:
movie = pd.merge(df,df1,on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [93]:
# Remove the redundant or useless columns i.e. ts
movie.drop('ts',axis=1,inplace=True)

In [94]:
# Find the number of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [95]:
# Average rating for  each movie
rating=pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False))

In [96]:
movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [98]:
#movie.corrwith()

In [101]:
movie_selected='Star Wars (1977)'

In [102]:
ms_rates=movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [97]:
corrs.sort_value(ascending=False).head(8)

NameError: name 'corrs' is not defined

In [104]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

def movie_recommended(movie_selected='Star Wars (1977)'):
    cols = ['user_id','movie_id','rating','ts']
    df=pd.read_csv('u.data',sep='\t',names=cols).drop('ts',axis=1)
    item_cols=['movie_id','title']+[str(i) for i in range(22)]
    df1 = pd.read_csv('u.item',sep='|',encoding = "ISO-8859-1",names=item_cols)[['movie_id','title']]
    
    # Merge the DataFrame
    movie = pd.merge(df,df1,on='movie_id')
    
    # Create Pivot Table
    movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')
    
    # Find similarity for selected movie
    corrs=movie_pivot.corrwith(movie_pivot[movie_selected])
    corrs_df=pd.dataFrame(corrs,columns=['correlation'])
    corrs_df['rating']=movie.groupby('title')('rating').mean()
    corrs_df['count']=movie['title'].value_counts()
    
    # Find to 2-3 recommendations
    top_recom=list(corrs_df[corrs_df['count']>50].sort_values(by='correlation',ascending=False).head(3).index)
    top_recom.remove(movie_selected)
    
    return top_recom